namespace DriverSchoolApp.Models;

public class IndexViewModel
{
    public string HeaderCarouselTextFirst => "Научете се да шофирате с увереност";
    public string HeaderCarouselTextSecond => "Безопасното шофиране е наш основен приоритет";
    public string EasyDrivingLearn => "Oбучение за шофиране";
    public string NationalInstructor => "Лицензиран инструктор";
    public string GetLicence => "Придобиване на лиценз";

    public string Title => "Ние обучаваме и формираме отлично подготвени бъдещи шофьори";
    public string TeamTitle => "Имаме голям опит в шофирането";
    public string Description => "\"АВТОШКОЛА “ПЕТЯ ВВС\", ЕООД има доказано  професионалното отношение към курсистите.";
    public string text1 => "Индивидуален подход в обучението, акцентиращ върху съобразяването с индивидуалните особености и изисквания на всеки един кандидат-шофьор.";
    public string text2 => "Максимална гъвкавост по отношение на съобразяване с удобно за вас време за кормуване, както и на място за взимане и оставяне след кормуване.";
    public string text3 => "Възможност да придобиете конкретни впечатления от дейността на учебният център като присъствате на учебния процес с настоящи курсисти. Елате и вижте как работим, за да сте сигурни, че сте направили информиран избор.";
    public string text4 => "Нов и лесен за управление учебен автомобил";
    public string text5 => "Учебните материали се осигуряват от учебния център,Онлайн листовки за по-бърза и качествена подготовка";
    public string text6 => "Записване и започване на обучение – веднага (съобразно нормативните изисквания).";
    public string text7 => "Възможност за разсрочено плащане.";
}
