namespace DriverSchoolApp.Models.Categories;

public class Category_C
{
    public string PageTitle => "Ние обучаваме и формираме отлично подготвени бъдещи шофьори";

    public string CategoryName => "категория \"C\"";

    public string CategoryRules => "Какво ни е нужно да започнем";

    public string CategoryDescription => "Лице с правоспособност за управление на МПС от категория С има право да управлява: Товарни автомобили, чиято допустима максимална маса надвишава 3500 кг. Към тях може да се прикачва ремарке с допустима максимална маса не повече от 750 кг.";

    public Dictionary<string, string> NecessaryDocuments
        => new Dictionary<string, string>()
    {
        { "Диплома", "Валидна диплома за завършено средно образование"},
        { "Лична карта", "Валиден документ за самоличност"},
        { "Снимка паспортен формат", "Актуална снимка"},
        { "Психо тест","Да отговаря на изискванията за психологическа годност" },
        { "Категория В","Да притежава категория В" },
        { "Необходима минимално възраст","Да е на възраст не по-малко от 21 години"}
    };

    public string IncludesTraining => "Какво включва обучението";

    public IReadOnlyList<string> IncludesTrainings
        => new List<string>()
    {
            "Шофьорският курс включва два модула на обучение – теоретичен и практически",
            "Подготовка на автомобила за движение",
            "Обучението по \"Управление на МПС\" е индивидуално, като продължителността на един учебен час е 50 минути",
            "Провежда се на учебна площадка, на пътища в населено и извън населено място",
            "Безопасно управление на автомобила при различни пътни условия",
            "Изпит за придобиване на правоспособност",
            "Лицата, които кандидатстват за придобиване на правоспособност за управление на МПС от категория С полагат теоретичен и практически изпит",
    };
}
